;******************************************************************************
;* TI ARM C/C++ Codegen                                             PC v5.1.5 *
;* Date/Time created: Tue Jul 15 14:01:18 2014                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --diag_wrap=off --disable_dual_state --embedded_constants=on --endian=little --float_support=FPv4SPD16 --hll_source=on --object_format=elf --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../src/ADC.cpp")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.1.5 Copyright (c) 1996-2014 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Dropbox\CCS workspace\BLDC\Debug")

;*****************************************************************************
;* FUNCTION SYNONYMS                                                         *
;*****************************************************************************
	.symalias _ZN8ADCClassC2Ev, _ZN8ADCClassC1Ev
	.symalias _ZN8ADCClassD2Ev, _ZN8ADCClassD1Ev

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("operator delete ")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("_ZdlPv")
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external

	.dwattr $C$DW$258, DW_AT_name("_ZN8ADCClass15enableInterruptEv")
	.dwattr $C$DW$258, DW_AT_TI_call
        BL        _ZN8ADCClass15enableInterruptEv ; [DPU_3_PIPE] |183| 
        ; CALL OCCURS {_ZN8ADCClass15enableInterruptEv }  ; [] |183| 
        B         ||$C$L17||            ; [DPU_3_PIPE] |183| 
        ; BRANCH OCCURS {||$C$L17||}     ; [] |183| 
;* --------------------------------------------------------------------------*
||$C$L14||:    
;**	-----------------------g8:
;** 188	-----------------------    ADCClass::enableInterrupt(this);
;**	-----------------------g9:
;**  	-----------------------    return;
;**	-----------------------g10:
	.dwpsn	file "../src/ADC.cpp",line 188,column 4,is_stmt,isa 1
        MOV       A1, V1                ; [DPU_3_PIPE] |188| 
$C$DW$259	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$259, DW_AT_low_pc(0x00)
	.dwattr $C$DW$259, DW_AT_name("_ZN8ADCClass15enableInterruptEv")
	.dwattr $C$DW$259, DW_AT_TI_call
        BL        _ZN8ADCClass15enableInterruptEv ; [DPU_3_PIPE] |188| 
        ; CALL OCCURS {_ZN8ADCClass15enableInterruptEv }  ; [] |188| 
        B         ||$C$L17||            ; [DPU_3_PIPE] 
        ; BRANCH OCCURS {||$C$L17||}     ; [] 
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L15||
;*
;*   Loop source line                : 172
;*   Loop closing brace source line  : 172
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L15||:    
;**	-----------------------g11:
;** 172	-----------------------    goto g11;
;**	-----------------------g12:
	.dwpsn	file "../src/ADC.cpp",line 172,column 9,is_stmt,isa 1
        B         ||$C$L15||            ; [DPU_3_PIPE] |172| 
        ; BRANCH OCCURS {||$C$L15||}     ; [] |172| 
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L16||
;*
;*   Loop source line                : 169
;*   Loop closing brace source line  : 169
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L16||:    
;**	-----------------------g13:
;** 169	-----------------------    goto g13;
	.dwpsn	file "../src/ADC.cpp",line 169,column 9,is_stmt,isa 1
        B         ||$C$L16||            ; [DPU_3_PIPE] |169| 
        ; BRANCH OCCURS {||$C$L16||}     ; [] |169| 
;* --------------------------------------------------------------------------*
||$C$L17||:    
	.dwpsn	file "../src/ADC.cpp",line 206,column 1,is_stmt,isa 1
$C$DW$260	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$260, DW_AT_low_pc(0x00)
	.dwattr $C$DW$260, DW_AT_TI_return
        POP       {V1, PC}              ; [DPU_3_PIPE] 
	.dwcfi	cfa_offset, 0
        ; BRANCH OCCURS                  ; [] 
	.dwattr $C$DW$239, DW_AT_TI_end_file("../src/ADC.cpp")
	.dwattr $C$DW$239, DW_AT_TI_end_line(0xce)
	.dwattr $C$DW$239, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$239

;*****************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                             *
;*****************************************************************************
	.global	_ZdlPv
	.global	ADCIntRegister
	.global	ADCIntDisable
	.global	ADCIntEnable
	.global	ADCIntClear
	.global	ADCSequenceEnable
	.global	ADCSequenceConfigure
	.global	ADCSequenceStepConfigure
	.global	ADCSequenceDataGet
	.global	PWMGenIntTrigEnable
	.global	SysCtlPeripheralEnable
	.global	GPIOPinTypeADC
	.global	_ZN15ZCDetectorClassC2Ev
	.global	_ZN15ZCDetectorClassD2Ev
	.global	_ZN15ZCDetectorClass10ZCDetectedEjj
	.global	_ZN26CommutationControllerClass15enableInterruptEv
	.global	_ZN26CommutationControllerClass15setTimeoutValueEj
	.global	_ZN26CommutationControllerClass8getValueEv
	.global	_ZN8LEDClassC1Ev
	.global	_ZN8LEDClassD1Ev
	.global	_ZN8LEDClass4initEj
	.global	_ZN8LEDClass6toggleEv
	.global	_ZN10motorClass8getStateEv
	.global	_ZN10motorClass8setStateE14controlState_t
	.global	_ZTI15ZCDetectorClass
	.global	_ZTVN10__cxxabiv120__si_class_type_infoE
;*****************************************************************************
;* SECTION GROUPS                                                            *
;*****************************************************************************
	.group    "_ZTI8ADCClass", 1
	.gmember  ".const:.typeinfo:_ZTI8ADCClass"
	.endgroup
	.group    "_ZTS8ADCClass", 1
	.gmember  ".const:.typeinfo:_ZTS8ADCClass"
	.endgroup
	.group    "_ZTV8ADCClass", 1
	.gmember  ".const:_ZTV8ADCClass"
	.endgroup


;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
	.battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
	.battr "TI", Tag_File, 1, Tag_FP_interface(1)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
$C$DW$261	.dwtag  DW_TAG_member
	.dwattr $C$DW$261, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$261, DW_AT_name("tinfo")
	.dwattr $C$DW$261, DW_AT_TI_symbol_name("tinfo")
	.dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$261, DW_AT_decl_file("../src/ADC.cpp")
	.dwattr $C$DW$261, DW_AT_decl_line(0xce)
	.dwattr $C$DW$261, DW_AT_decl_column(0x01)
$C$DW$262	.dwtag  DW_TAG_member
	.dwattr $C$DW$262, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$262, DW_AT_name("offset_flags")
	.dwattr $C$DW$262, DW_AT_TI_symbol_name("offset_flags")
	.dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$262, DW_AT_decl_file("../src/ADC.cpp")
	.dwattr $C$DW$262, DW_AT_decl_line(0xce)
	.dwattr $C$DW$262, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$23


$C$DW$T$131	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$131, DW_AT_byte_size(0x08)
$C$DW$263	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$263, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$131


$C$DW$T$41	.dwtag  DW_TAG_class_type
	.dwattr $C$DW$T$41, DW_AT_name("ADCClass")
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x5c)
$C$DW$264	.dwtag  DW_TAG_inheritance
	.dwattr $C$DW$264, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$264, DW_AT_virtuality(0x00), DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
$C$DW$265	.dwtag  DW_TAG_member
	.dwattr $C$DW$265, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$265, DW_AT_name("__b_15ZCDetectorClass")
	.dwattr $C$DW$265, DW_AT_TI_symbol_name("__b_15ZCDetectorClass")
	.dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$265, DW_AT_decl_file("..\src\ZCDetector.h")
	.dwattr $C$DW$265, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$265, DW_AT_decl_column(0x1a)
$C$DW$266	.dwtag  DW_TAG_member
	.dwattr $C$DW$266, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$266, DW_AT_name("LED")
	.dwattr $C$DW$266, DW_AT_TI_symbol_name("LED")
	.dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$266, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$266, DW_AT_decl_line(0x33)
	.dwattr $C$DW$266, DW_AT_decl_column(0x0b)
$C$DW$267	.dwtag  DW_TAG_member
	.dwattr $C$DW$267, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$267, DW_AT_name("CommutationTimer")
	.dwattr $C$DW$267, DW_AT_TI_symbol_name("CommutationTimer")
	.dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$267, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$267, DW_AT_decl_line(0x34)
	.dwattr $C$DW$267, DW_AT_decl_column(0x1e)
$C$DW$268	.dwtag  DW_TAG_member
	.dwattr $C$DW$268, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$268, DW_AT_name("motorParent")
	.dwattr $C$DW$268, DW_AT_TI_symbol_name("motorParent")
	.dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$268, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$268, DW_AT_decl_line(0x35)
	.dwattr $C$DW$268, DW_AT_decl_column(0x0e)
$C$DW$269	.dwtag  DW_TAG_member
	.dwattr $C$DW$269, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$269, DW_AT_name("ADC_BASE")
	.dwattr $C$DW$269, DW_AT_TI_symbol_name("ADC_BASE")
	.dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$269, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$269, DW_AT_decl_line(0x37)
	.dwattr $C$DW$269, DW_AT_decl_column(0x0b)
$C$DW$270	.dwtag  DW_TAG_member
	.dwattr $C$DW$270, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$270, DW_AT_name("PWM_BASE")
	.dwattr $C$DW$270, DW_AT_TI_symbol_name("PWM_BASE")
	.dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$270, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$270, DW_AT_decl_line(0x37)
	.dwattr $C$DW$270, DW_AT_decl_column(0x15)
$C$DW$271	.dwtag  DW_TAG_member
	.dwattr $C$DW$271, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$271, DW_AT_name("SYSCTL_PERIPH_ADC")
	.dwattr $C$DW$271, DW_AT_TI_symbol_name("SYSCTL_PERIPH_ADC")
	.dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$271, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$271, DW_AT_decl_line(0x38)
	.dwattr $C$DW$271, DW_AT_decl_column(0x0b)
$C$DW$272	.dwtag  DW_TAG_member
	.dwattr $C$DW$272, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$272, DW_AT_name("SYSCTL_PERIPH_GPIO")
	.dwattr $C$DW$272, DW_AT_TI_symbol_name("SYSCTL_PERIPH_GPIO")
	.dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$272, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$272, DW_AT_decl_line(0x38)
	.dwattr $C$DW$272, DW_AT_decl_column(0x1e)
$C$DW$273	.dwtag  DW_TAG_member
	.dwattr $C$DW$273, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$273, DW_AT_name("GPIO_PORT_BASE")
	.dwattr $C$DW$273, DW_AT_TI_symbol_name("GPIO_PORT_BASE")
	.dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$273, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$273, DW_AT_decl_line(0x39)
	.dwattr $C$DW$273, DW_AT_decl_column(0x0b)
$C$DW$274	.dwtag  DW_TAG_member
	.dwattr $C$DW$274, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$274, DW_AT_name("GPIO_PIN_A")
	.dwattr $C$DW$274, DW_AT_TI_symbol_name("GPIO_PIN_A")
	.dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$274, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$274, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$274, DW_AT_decl_column(0x0b)
$C$DW$275	.dwtag  DW_TAG_member
	.dwattr $C$DW$275, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$275, DW_AT_name("GPIO_PIN_B")
	.dwattr $C$DW$275, DW_AT_TI_symbol_name("GPIO_PIN_B")
	.dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$275, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$275, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$275, DW_AT_decl_column(0x17)
$C$DW$276	.dwtag  DW_TAG_member
	.dwattr $C$DW$276, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$276, DW_AT_name("GPIO_PIN_C")
	.dwattr $C$DW$276, DW_AT_TI_symbol_name("GPIO_PIN_C")
	.dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$276, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$276, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$276, DW_AT_decl_column(0x23)
$C$DW$277	.dwtag  DW_TAG_member
	.dwattr $C$DW$277, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$277, DW_AT_name("ADC_TRIGGER_PWM")
	.dwattr $C$DW$277, DW_AT_TI_symbol_name("ADC_TRIGGER_PWM")
	.dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$277, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$277, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$277, DW_AT_decl_column(0x0b)
$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$278, DW_AT_name("ADC_CTL_A")
	.dwattr $C$DW$278, DW_AT_TI_symbol_name("ADC_CTL_A")
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$278, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$278, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$278, DW_AT_decl_column(0x0b)
$C$DW$279	.dwtag  DW_TAG_member
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$279, DW_AT_name("ADC_CTL_B")
	.dwattr $C$DW$279, DW_AT_TI_symbol_name("ADC_CTL_B")
	.dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$279, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$279, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$279, DW_AT_decl_column(0x16)
$C$DW$280	.dwtag  DW_TAG_member
	.dwattr $C$DW$280, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$280, DW_AT_name("ADC_CTL_C")
	.dwattr $C$DW$280, DW_AT_TI_symbol_name("ADC_CTL_C")
	.dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$280, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$280, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$280, DW_AT_decl_column(0x21)
$C$DW$281	.dwtag  DW_TAG_member
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$281, DW_AT_name("buf")
	.dwattr $C$DW$281, DW_AT_TI_symbol_name("buf")
	.dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$281, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$281, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$281, DW_AT_decl_column(0x0b)
$C$DW$282	.dwtag  DW_TAG_member
	.dwattr $C$DW$282, DW_AT_type(*$C$DW$T$4)
	.dwattr $C$DW$282, DW_AT_name("ZCDetectedFlag")
	.dwattr $C$DW$282, DW_AT_TI_symbol_name("ZCDetectedFlag")
	.dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$282, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$282, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$282, DW_AT_decl_column(0x07)

$C$DW$3	.dwtag  DW_TAG_subprogram, DW_AT_name("ADCClass")
	.dwattr $C$DW$3, DW_AT_declaration
	.dwattr $C$DW$3, DW_AT_TI_symbol_name("_ZN8ADCClassC1Ev")
	.dwattr $C$DW$3, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$4	.dwtag  DW_TAG_subprogram, DW_AT_name("~ADCClass")
	.dwattr $C$DW$4, DW_AT_declaration
	.dwattr $C$DW$4, DW_AT_TI_symbol_name("_ZN8ADCClassD1Ev")
	.dwattr $C$DW$4, DW_AT_virtuality(0x01), DW_AT_vtable_elem_location[DW_OP_constu 0x00]
	.dwattr $C$DW$4, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$5	.dwtag  DW_TAG_subprogram, DW_AT_name("init")
	.dwattr $C$DW$5, DW_AT_declaration
	.dwattr $C$DW$5, DW_AT_TI_symbol_name("_ZN8ADCClass4initEjP26CommutationControllerClassP10motorClass")
	.dwattr $C$DW$5, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$283	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$26)
$C$DW$284	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$284, DW_AT_type(*$C$DW$T$24)
$C$DW$285	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$25)
	.dwendtag $C$DW$5


$C$DW$6	.dwtag  DW_TAG_subprogram, DW_AT_name("getMeasurement")
	.dwattr $C$DW$6, DW_AT_declaration
	.dwattr $C$DW$6, DW_AT_TI_symbol_name("_ZN8ADCClass14getMeasurementEv")
	.dwattr $C$DW$6, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$7	.dwtag  DW_TAG_subprogram, DW_AT_name("getMeasurementTime")
	.dwattr $C$DW$7, DW_AT_declaration
	.dwattr $C$DW$7, DW_AT_TI_symbol_name("_ZN8ADCClass18getMeasurementTimeEv")
	.dwattr $C$DW$7, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$8	.dwtag  DW_TAG_subprogram, DW_AT_name("enableInterrupt")
	.dwattr $C$DW$8, DW_AT_declaration
	.dwattr $C$DW$8, DW_AT_TI_symbol_name("_ZN8ADCClass15enableInterruptEv")
	.dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$9	.dwtag  DW_TAG_subprogram, DW_AT_name("disableInterrupt")
	.dwattr $C$DW$9, DW_AT_declaration
	.dwattr $C$DW$9, DW_AT_TI_symbol_name("_ZN8ADCClass16disableInterruptEv")
	.dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$10	.dwtag  DW_TAG_subprogram, DW_AT_name("setPhase")
	.dwattr $C$DW$10, DW_AT_declaration
	.dwattr $C$DW$10, DW_AT_TI_symbol_name("_ZN8ADCClass8setPhaseE7phase_t")
	.dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$286	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$32)
	.dwendtag $C$DW$10


$C$DW$11	.dwtag  DW_TAG_subprogram, DW_AT_name("getZCDetectedFlag")
	.dwattr $C$DW$11, DW_AT_declaration
	.dwattr $C$DW$11, DW_AT_TI_symbol_name("_ZN8ADCClass17getZCDetectedFlagEv")
	.dwattr $C$DW$11, DW_AT_type(*$C$DW$T$4)
	.dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$12	.dwtag  DW_TAG_subprogram, DW_AT_name("clearZCDetectedFlag")
	.dwattr $C$DW$12, DW_AT_declaration
	.dwattr $C$DW$12, DW_AT_TI_symbol_name("_ZN8ADCClass19clearZCDetectedFlagEv")
	.dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$13	.dwtag  DW_TAG_subprogram, DW_AT_name("ISR0Static")
	.dwattr $C$DW$13, DW_AT_declaration
	.dwattr $C$DW$13, DW_AT_TI_symbol_name("_ZN8ADCClass10ISR0StaticEv")
	.dwattr $C$DW$13, DW_AT_external
	.dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_private)

$C$DW$14	.dwtag  DW_TAG_subprogram, DW_AT_name("ISR1Static")
	.dwattr $C$DW$14, DW_AT_declaration
	.dwattr $C$DW$14, DW_AT_TI_symbol_name("_ZN8ADCClass10ISR1StaticEv")
	.dwattr $C$DW$14, DW_AT_external
	.dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_private)

$C$DW$15	.dwtag  DW_TAG_subprogram, DW_AT_name("initAsADC0")
	.dwattr $C$DW$15, DW_AT_declaration
	.dwattr $C$DW$15, DW_AT_TI_symbol_name("_ZN8ADCClass10initAsADC0Ev")
	.dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_private)

$C$DW$16	.dwtag  DW_TAG_subprogram, DW_AT_name("initAsADC1")
	.dwattr $C$DW$16, DW_AT_declaration
	.dwattr $C$DW$16, DW_AT_TI_symbol_name("_ZN8ADCClass10initAsADC1Ev")
	.dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_private)

$C$DW$17	.dwtag  DW_TAG_subprogram, DW_AT_name("IIRFilter")
	.dwattr $C$DW$17, DW_AT_declaration
	.dwattr $C$DW$17, DW_AT_TI_symbol_name("_ZN8ADCClass9IIRFilterEj")
	.dwattr $C$DW$17, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_private)
$C$DW$287	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$26)
	.dwendtag $C$DW$17


$C$DW$18	.dwtag  DW_TAG_subprogram, DW_AT_name("ISR")
	.dwattr $C$DW$18, DW_AT_declaration
	.dwattr $C$DW$18, DW_AT_TI_symbol_name("_ZN8ADCClass3ISREv")
	.dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_private)

$C$DW$19	.dwtag  DW_TAG_subprogram, DW_AT_name("ADCClass")
	.dwattr $C$DW$19, DW_AT_declaration
	.dwattr $C$DW$19, DW_AT_TI_symbol_name("_ZN8ADCClassC1ERKS_")
	.dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$288	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$37)
	.dwendtag $C$DW$19


$C$DW$20	.dwtag  DW_TAG_subprogram, DW_AT_name("operator =")
	.dwattr $C$DW$20, DW_AT_declaration
	.dwattr $C$DW$20, DW_AT_TI_symbol_name("_ZN8ADCClassaSERKS_")
	.dwattr $C$DW$20, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$289	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$289, DW_AT_type(*$C$DW$T$37)
	.dwendtag $C$DW$20

	.dwendtag $C$DW$T$41

	.dwattr $C$DW$T$41, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x07)
$C$DW$T$36	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$41)
$C$DW$T$37	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$37, DW_AT_address_class(0x20)
$C$DW$T$39	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$39, DW_AT_address_class(0x20)

$C$DW$T$40	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$290	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$37)
	.dwendtag $C$DW$T$40

$C$DW$T$48	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$48, DW_AT_address_class(0x20)
$C$DW$T$145	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$48)

$C$DW$T$56	.dwtag  DW_TAG_class_type
	.dwattr $C$DW$T$56, DW_AT_name("CommutationControllerClass")
	.dwattr $C$DW$T$56, DW_AT_byte_size(0xb8)
$C$DW$291	.dwtag  DW_TAG_inheritance
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$291, DW_AT_virtuality(0x00), DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
$C$DW$292	.dwtag  DW_TAG_member
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$292, DW_AT_name("__b_15CommutatorClass")
	.dwattr $C$DW$292, DW_AT_TI_symbol_name("__b_15CommutatorClass")
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$292, DW_AT_decl_file("..\src\CommutationController.h")
	.dwattr $C$DW$292, DW_AT_decl_line(0x18)
	.dwattr $C$DW$292, DW_AT_decl_column(0x07)
$C$DW$293	.dwtag  DW_TAG_member
	.dwattr $C$DW$293, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$293, DW_AT_name("ADC")
	.dwattr $C$DW$293, DW_AT_TI_symbol_name("ADC")
	.dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$293, DW_AT_decl_file("..\src\CommutationController.h")
	.dwattr $C$DW$293, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$293, DW_AT_decl_column(0x0c)
$C$DW$294	.dwtag  DW_TAG_member
	.dwattr $C$DW$294, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$294, DW_AT_name("motorParent")
	.dwattr $C$DW$294, DW_AT_TI_symbol_name("motorParent")
	.dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$294, DW_AT_decl_file("..\src\CommutationController.h")
	.dwattr $C$DW$294, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$294, DW_AT_decl_column(0x0e)
$C$DW$295	.dwtag  DW_TAG_member
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$295, DW_AT_name("SYSCTL_PERIPH_TIMER")
	.dwattr $C$DW$295, DW_AT_TI_symbol_name("SYSCTL_PERIPH_TIMER")
	.dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
	.dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$295, DW_AT_decl_file("..\src\CommutationController.h")
	.dwattr $C$DW$295, DW_AT_decl_line(0x31)
	.dwattr $C$DW$295, DW_AT_decl_column(0x0b)
$C$DW$296	.dwtag  DW_TAG_member
	.dwattr $C$DW$296, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$296, DW_AT_name("TIMER_BASE")
	.dwattr $C$DW$296, DW_AT_TI_symbol_name("TIMER_BASE")
	.dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$296, DW_AT_decl_file("..\src\CommutationController.h")
	.dwattr $C$DW$296, DW_AT_decl_line(0x32)
	.dwattr $C$DW$296, DW_AT_decl_column(0x0b)
$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$297, DW_AT_name("missedZCCounter")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("missedZCCounter")
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$297, DW_AT_decl_file("..\src\CommutationController.h")
	.dwattr $C$DW$297, DW_AT_decl_line(0x34)
	.dwattr $C$DW$297, DW_AT_decl_column(0x0b)

$C$DW$21	.dwtag  DW_TAG_subprogram, DW_AT_name("CommutationControllerClass")
	.dwattr $C$DW$21, DW_AT_declaration
	.dwattr $C$DW$21, DW_AT_TI_symbol_name("_ZN26CommutationControllerClassC1Ev")
	.dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$22	.dwtag  DW_TAG_subprogram, DW_AT_name("~CommutationControllerClass")
	.dwattr $C$DW$22, DW_AT_declaration
	.dwattr $C$DW$22, DW_AT_TI_symbol_name("_ZN26CommutationControllerClassD1Ev")
	.dwattr $C$DW$22, DW_AT_virtuality(0x01), DW_AT_vtable_elem_location[DW_OP_constu 0x00]
	.dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$23	.dwtag  DW_TAG_subprogram, DW_AT_name("init")
	.dwattr $C$DW$23, DW_AT_declaration
	.dwattr $C$DW$23, DW_AT_TI_symbol_name("_ZN26CommutationControllerClass4initEjP8ADCClassP10motorClass")
	.dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$298	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$298, DW_AT_type(*$C$DW$T$26)
$C$DW$299	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$48)
$C$DW$300	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$25)
	.dwendtag $C$DW$23


$C$DW$24	.dwtag  DW_TAG_subprogram, DW_AT_name("enable")
	.dwattr $C$DW$24, DW_AT_declaration
	.dwattr $C$DW$24, DW_AT_TI_symbol_name("_ZN26CommutationControllerClass6enableEv")
	.dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$25	.dwtag  DW_TAG_subprogram, DW_AT_name("disable")
	.dwattr $C$DW$25, DW_AT_declaration
	.dwattr $C$DW$25, DW_AT_TI_symbol_name("_ZN26CommutationControllerClass7disableEv")
	.dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$26	.dwtag  DW_TAG_subprogram, DW_AT_name("enableInterrupt")
	.dwattr $C$DW$26, DW_AT_declaration
	.dwattr $C$DW$26, DW_AT_TI_symbol_name("_ZN26CommutationControllerClass15enableInterruptEv")
	.dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$27	.dwtag  DW_TAG_subprogram, DW_AT_name("disableInterrupt")
	.dwattr $C$DW$27, DW_AT_declaration
	.dwattr $C$DW$27, DW_AT_TI_symbol_name("_ZN26CommutationControllerClass16disableInterruptEv")
	.dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$28	.dwtag  DW_TAG_subprogram, DW_AT_name("setTimeoutValue")
	.dwattr $C$DW$28, DW_AT_declaration
	.dwattr $C$DW$28, DW_AT_TI_symbol_name("_ZN26CommutationControllerClass15setTimeoutValueEj")
	.dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$301	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$26)
	.dwendtag $C$DW$28


$C$DW$29	.dwtag  DW_TAG_subprogram, DW_AT_name("getTimeoutValue")
	.dwattr $C$DW$29, DW_AT_declaration
	.dwattr $C$DW$29, DW_AT_TI_symbol_name("_ZN26CommutationControllerClass15getTimeoutValueEv")
	.dwattr $C$DW$29, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$30	.dwtag  DW_TAG_subprogram, DW_AT_name("getValue")
	.dwattr $C$DW$30, DW_AT_declaration
	.dwattr $C$DW$30, DW_AT_TI_symbol_name("_ZN26CommutationControllerClass8getValueEv")
	.dwattr $C$DW$30, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$31	.dwtag  DW_TAG_subprogram, DW_AT_name("initAsTimer0")
	.dwattr $C$DW$31, DW_AT_declaration
	.dwattr $C$DW$31, DW_AT_TI_symbol_name("_ZN26CommutationControllerClass12initAsTimer0Ev")
	.dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_private)

$C$DW$32	.dwtag  DW_TAG_subprogram, DW_AT_name("initAsTimer1")
	.dwattr $C$DW$32, DW_AT_declaration
	.dwattr $C$DW$32, DW_AT_TI_symbol_name("_ZN26CommutationControllerClass12initAsTimer1Ev")
	.dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_private)

$C$DW$33	.dwtag  DW_TAG_subprogram, DW_AT_name("ISR0Static")
	.dwattr $C$DW$33, DW_AT_declaration
	.dwattr $C$DW$33, DW_AT_TI_symbol_name("_ZN26CommutationControllerClass10ISR0StaticEv")
	.dwattr $C$DW$33, DW_AT_external
	.dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_private)

$C$DW$34	.dwtag  DW_TAG_subprogram, DW_AT_name("ISR1Static")
	.dwattr $C$DW$34, DW_AT_declaration
	.dwattr $C$DW$34, DW_AT_TI_symbol_name("_ZN26CommutationControllerClass10ISR1StaticEv")
	.dwattr $C$DW$34, DW_AT_external
	.dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_private)

$C$DW$35	.dwtag  DW_TAG_subprogram, DW_AT_name("ISR")
	.dwattr $C$DW$35, DW_AT_declaration
	.dwattr $C$DW$35, DW_AT_TI_symbol_name("_ZN26CommutationControllerClass3ISREv")
	.dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_private)

$C$DW$36	.dwtag  DW_TAG_subprogram, DW_AT_name("CommutationControllerClass")
	.dwattr $C$DW$36, DW_AT_declaration
	.dwattr $C$DW$36, DW_AT_TI_symbol_name("_ZN26CommutationControllerClassC1ERKS_")
	.dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$302	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$52)
	.dwendtag $C$DW$36


$C$DW$37	.dwtag  DW_TAG_subprogram, DW_AT_name("operator =")
	.dwattr $C$DW$37, DW_AT_declaration
	.dwattr $C$DW$37, DW_AT_TI_symbol_name("_ZN26CommutationControllerClassaSERKS_")
	.dwattr $C$DW$37, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$303	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$52)
	.dwendtag $C$DW$37

	.dwendtag $C$DW$T$56

	.dwattr $C$DW$T$56, DW_AT_decl_file("..\src\CommutationController.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x18)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x07)
$C$DW$T$51	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$56)
$C$DW$T$52	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$52, DW_AT_address_class(0x20)
$C$DW$T$24	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$24, DW_AT_address_class(0x20)
$C$DW$T$54	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$54, DW_AT_address_class(0x20)

$C$DW$T$55	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$304	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$52)
	.dwendtag $C$DW$T$55


$C$DW$T$65	.dwtag  DW_TAG_class_type
	.dwattr $C$DW$T$65, DW_AT_name("CommutatorClass")
	.dwattr $C$DW$T$65, DW_AT_byte_size(0xa4)
$C$DW$305	.dwtag  DW_TAG_inheritance
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$305, DW_AT_virtuality(0x00), DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$306, DW_AT_name("__b_8PWMClass")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("__b_8PWMClass")
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$306, DW_AT_decl_file("..\src\Commutator.h")
	.dwattr $C$DW$306, DW_AT_decl_line(0x11)
	.dwattr $C$DW$306, DW_AT_decl_column(0x07)
$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$307, DW_AT_name("state")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("state")
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$307, DW_AT_decl_file("..\src\Commutator.h")
	.dwattr $C$DW$307, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$307, DW_AT_decl_column(0x0b)
$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$308, DW_AT_name("ADC")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("ADC")
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$308, DW_AT_decl_file("..\src\Commutator.h")
	.dwattr $C$DW$308, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$308, DW_AT_decl_column(0x0c)

$C$DW$38	.dwtag  DW_TAG_subprogram, DW_AT_name("CommutatorClass")
	.dwattr $C$DW$38, DW_AT_declaration
	.dwattr $C$DW$38, DW_AT_TI_symbol_name("_ZN15CommutatorClassC1Ev")
	.dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$39	.dwtag  DW_TAG_subprogram, DW_AT_name("~CommutatorClass")
	.dwattr $C$DW$39, DW_AT_declaration
	.dwattr $C$DW$39, DW_AT_TI_symbol_name("_ZN15CommutatorClassD1Ev")
	.dwattr $C$DW$39, DW_AT_virtuality(0x01), DW_AT_vtable_elem_location[DW_OP_constu 0x00]
	.dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$40	.dwtag  DW_TAG_subprogram, DW_AT_name("init")
	.dwattr $C$DW$40, DW_AT_declaration
	.dwattr $C$DW$40, DW_AT_TI_symbol_name("_ZN15CommutatorClass4initEjP8ADCClass")
	.dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_protected)
$C$DW$309	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$26)
$C$DW$310	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$48)
	.dwendtag $C$DW$40


$C$DW$41	.dwtag  DW_TAG_subprogram, DW_AT_name("commutate")
	.dwattr $C$DW$41, DW_AT_declaration
	.dwattr $C$DW$41, DW_AT_TI_symbol_name("_ZN15CommutatorClass9commutateEv")
	.dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_protected)

$C$DW$42	.dwtag  DW_TAG_subprogram, DW_AT_name("CommutatorClass")
	.dwattr $C$DW$42, DW_AT_declaration
	.dwattr $C$DW$42, DW_AT_TI_symbol_name("_ZN15CommutatorClassC1ERKS_")
	.dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$311	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$61)
	.dwendtag $C$DW$42


$C$DW$43	.dwtag  DW_TAG_subprogram, DW_AT_name("operator =")
	.dwattr $C$DW$43, DW_AT_declaration
	.dwattr $C$DW$43, DW_AT_TI_symbol_name("_ZN15CommutatorClassaSERKS_")
	.dwattr $C$DW$43, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$312	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$61)
	.dwendtag $C$DW$43

	.dwendtag $C$DW$T$65

	.dwattr $C$DW$T$65, DW_AT_decl_file("..\src\Commutator.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x11)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x07)
$C$DW$T$60	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$65)
$C$DW$T$61	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$61, DW_AT_address_class(0x20)
$C$DW$T$63	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$63, DW_AT_address_class(0x20)

$C$DW$T$64	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$313	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$61)
	.dwendtag $C$DW$T$64


$C$DW$T$74	.dwtag  DW_TAG_class_type
	.dwattr $C$DW$T$74, DW_AT_name("LEDClass")
	.dwattr $C$DW$T$74, DW_AT_byte_size(0x10)
$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$314, DW_AT_name("__vptr")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("__vptr")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$314, DW_AT_decl_file("..\src\LED.h")
	.dwattr $C$DW$314, DW_AT_decl_line(0x14)
	.dwattr $C$DW$314, DW_AT_decl_column(0x07)
$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$315, DW_AT_name("SYSCTL_PERIPH_GPIO")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("SYSCTL_PERIPH_GPIO")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$315, DW_AT_decl_file("..\src\LED.h")
	.dwattr $C$DW$315, DW_AT_decl_line(0x22)
	.dwattr $C$DW$315, DW_AT_decl_column(0x0b)
$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$316, DW_AT_name("GPIO_PORT_BASE")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("GPIO_PORT_BASE")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$316, DW_AT_decl_file("..\src\LED.h")
	.dwattr $C$DW$316, DW_AT_decl_line(0x23)
	.dwattr $C$DW$316, DW_AT_decl_column(0x0b)
$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$317, DW_AT_name("GPIO_PIN")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("GPIO_PIN")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$317, DW_AT_decl_file("..\src\LED.h")
	.dwattr $C$DW$317, DW_AT_decl_line(0x24)
	.dwattr $C$DW$317, DW_AT_decl_column(0x0b)

$C$DW$44	.dwtag  DW_TAG_subprogram, DW_AT_name("LEDClass")
	.dwattr $C$DW$44, DW_AT_declaration
	.dwattr $C$DW$44, DW_AT_TI_symbol_name("_ZN8LEDClassC1Ev")
	.dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$45	.dwtag  DW_TAG_subprogram, DW_AT_name("~LEDClass")
	.dwattr $C$DW$45, DW_AT_declaration
	.dwattr $C$DW$45, DW_AT_TI_symbol_name("_ZN8LEDClassD1Ev")
	.dwattr $C$DW$45, DW_AT_virtuality(0x01), DW_AT_vtable_elem_location[DW_OP_constu 0x00]
	.dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$46	.dwtag  DW_TAG_subprogram, DW_AT_name("init")
	.dwattr $C$DW$46, DW_AT_declaration
	.dwattr $C$DW$46, DW_AT_TI_symbol_name("_ZN8LEDClass4initEj")
	.dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$318	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$26)
	.dwendtag $C$DW$46


$C$DW$47	.dwtag  DW_TAG_subprogram, DW_AT_name("clear")
	.dwattr $C$DW$47, DW_AT_declaration
	.dwattr $C$DW$47, DW_AT_TI_symbol_name("_ZN8LEDClass5clearEv")
	.dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$48	.dwtag  DW_TAG_subprogram, DW_AT_name("set")
	.dwattr $C$DW$48, DW_AT_declaration
	.dwattr $C$DW$48, DW_AT_TI_symbol_name("_ZN8LEDClass3setEv")
	.dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$49	.dwtag  DW_TAG_subprogram, DW_AT_name("toggle")
	.dwattr $C$DW$49, DW_AT_declaration
	.dwattr $C$DW$49, DW_AT_TI_symbol_name("_ZN8LEDClass6toggleEv")
	.dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$50	.dwtag  DW_TAG_subprogram, DW_AT_name("initAsLED0")
	.dwattr $C$DW$50, DW_AT_declaration
	.dwattr $C$DW$50, DW_AT_TI_symbol_name("_ZN8LEDClass10initAsLED0Ev")
	.dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_private)

$C$DW$51	.dwtag  DW_TAG_subprogram, DW_AT_name("initAsLED1")
	.dwattr $C$DW$51, DW_AT_declaration
	.dwattr $C$DW$51, DW_AT_TI_symbol_name("_ZN8LEDClass10initAsLED1Ev")
	.dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_private)

$C$DW$52	.dwtag  DW_TAG_subprogram, DW_AT_name("LEDClass")
	.dwattr $C$DW$52, DW_AT_declaration
	.dwattr $C$DW$52, DW_AT_TI_symbol_name("_ZN8LEDClassC1ERKS_")
	.dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$319	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$70)
	.dwendtag $C$DW$52


$C$DW$53	.dwtag  DW_TAG_subprogram, DW_AT_name("operator =")
	.dwattr $C$DW$53, DW_AT_declaration
	.dwattr $C$DW$53, DW_AT_TI_symbol_name("_ZN8LEDClassaSERKS_")
	.dwattr $C$DW$53, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$320	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$70)
	.dwendtag $C$DW$53

	.dwendtag $C$DW$T$74

	.dwattr $C$DW$T$74, DW_AT_decl_file("..\src\LED.h")
	.dwattr $C$DW$T$74, DW_AT_decl_line(0x14)
	.dwattr $C$DW$T$74, DW_AT_decl_column(0x07)
$C$DW$T$69	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$74)
$C$DW$T$70	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$T$70, DW_AT_address_class(0x20)
$C$DW$T$72	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$T$72, DW_AT_address_class(0x20)

$C$DW$T$73	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$321	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$70)
	.dwendtag $C$DW$T$73


$C$DW$T$82	.dwtag  DW_TAG_class_type
	.dwattr $C$DW$T$82, DW_AT_name("PWMClass")
	.dwattr $C$DW$T$82, DW_AT_byte_size(0x9c)
$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$322, DW_AT_name("__vptr")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("__vptr")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$322, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$322, DW_AT_decl_line(0x15)
	.dwattr $C$DW$322, DW_AT_decl_column(0x07)
$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$323, DW_AT_name("SYSCTL_PERIPH_PWM")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("SYSCTL_PERIPH_PWM")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$323, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$323, DW_AT_decl_line(0x24)
	.dwattr $C$DW$323, DW_AT_decl_column(0x0b)
$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$324, DW_AT_name("SYSCTL_PERIPH_GPIO_CH_A")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("SYSCTL_PERIPH_GPIO_CH_A")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$324, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$324, DW_AT_decl_line(0x24)
	.dwattr $C$DW$324, DW_AT_decl_column(0x1e)
$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$325, DW_AT_name("SYSCTL_PERIPH_GPIO_CH_B")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("SYSCTL_PERIPH_GPIO_CH_B")
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$325, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$325, DW_AT_decl_line(0x24)
	.dwattr $C$DW$325, DW_AT_decl_column(0x37)
$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$326, DW_AT_name("SYSCTL_PERIPH_GPIO_CH_C")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("SYSCTL_PERIPH_GPIO_CH_C")
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$326, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$326, DW_AT_decl_line(0x24)
	.dwattr $C$DW$326, DW_AT_decl_column(0x50)
$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$327, DW_AT_name("GPIO_CFG_H1")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("GPIO_CFG_H1")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$327, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$327, DW_AT_decl_line(0x25)
	.dwattr $C$DW$327, DW_AT_decl_column(0x0b)
$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$328, DW_AT_name("GPIO_CFG_L1")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("GPIO_CFG_L1")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$328, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$328, DW_AT_decl_line(0x25)
	.dwattr $C$DW$328, DW_AT_decl_column(0x18)
$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$329, DW_AT_name("GPIO_CFG_H2")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("GPIO_CFG_H2")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$329, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$329, DW_AT_decl_line(0x25)
	.dwattr $C$DW$329, DW_AT_decl_column(0x25)
$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$330, DW_AT_name("GPIO_CFG_L2")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("GPIO_CFG_L2")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$330, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$330, DW_AT_decl_line(0x25)
	.dwattr $C$DW$330, DW_AT_decl_column(0x32)
$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$331, DW_AT_name("GPIO_CFG_H3")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("GPIO_CFG_H3")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$331, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$331, DW_AT_decl_line(0x25)
	.dwattr $C$DW$331, DW_AT_decl_column(0x3f)
$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$332, DW_AT_name("GPIO_CFG_L3")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("GPIO_CFG_L3")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$332, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$332, DW_AT_decl_line(0x25)
	.dwattr $C$DW$332, DW_AT_decl_column(0x4c)
$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$333, DW_AT_name("GPIO_PORT_CH_A_BASE")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("GPIO_PORT_CH_A_BASE")
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$333, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$333, DW_AT_decl_line(0x26)
	.dwattr $C$DW$333, DW_AT_decl_column(0x0b)
$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$334, DW_AT_name("GPIO_PORT_CH_B_BASE")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("GPIO_PORT_CH_B_BASE")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$334, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$334, DW_AT_decl_line(0x26)
	.dwattr $C$DW$334, DW_AT_decl_column(0x20)
$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$335, DW_AT_name("GPIO_PORT_CH_C_BASE")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("GPIO_PORT_CH_C_BASE")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$335, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$335, DW_AT_decl_line(0x26)
	.dwattr $C$DW$335, DW_AT_decl_column(0x35)
$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$336, DW_AT_name("GPIO_PIN_H1")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("GPIO_PIN_H1")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$336, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$336, DW_AT_decl_line(0x27)
	.dwattr $C$DW$336, DW_AT_decl_column(0x0b)
$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$337, DW_AT_name("GPIO_PIN_L1")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("GPIO_PIN_L1")
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$337, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$337, DW_AT_decl_line(0x27)
	.dwattr $C$DW$337, DW_AT_decl_column(0x18)
$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$338, DW_AT_name("GPIO_PIN_H2")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("GPIO_PIN_H2")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$338, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$338, DW_AT_decl_line(0x27)
	.dwattr $C$DW$338, DW_AT_decl_column(0x25)
$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$339, DW_AT_name("GPIO_PIN_L2")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("GPIO_PIN_L2")
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$339, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$339, DW_AT_decl_line(0x27)
	.dwattr $C$DW$339, DW_AT_decl_column(0x32)
$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$340, DW_AT_name("GPIO_PIN_H3")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("GPIO_PIN_H3")
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$340, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$340, DW_AT_decl_line(0x27)
	.dwattr $C$DW$340, DW_AT_decl_column(0x3f)
$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$341, DW_AT_name("GPIO_PIN_L3")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("GPIO_PIN_L3")
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$341, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$341, DW_AT_decl_line(0x27)
	.dwattr $C$DW$341, DW_AT_decl_column(0x4c)
$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$342, DW_AT_name("PWM_BASE")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("PWM_BASE")
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$342, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$342, DW_AT_decl_line(0x28)
	.dwattr $C$DW$342, DW_AT_decl_column(0x0b)
$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$343, DW_AT_name("PWM_OUT_H1_BIT")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("PWM_OUT_H1_BIT")
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$343, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$343, DW_AT_decl_line(0x29)
	.dwattr $C$DW$343, DW_AT_decl_column(0x0b)
$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$344, DW_AT_name("PWM_OUT_L1_BIT")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("PWM_OUT_L1_BIT")
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$344, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$344, DW_AT_decl_line(0x29)
	.dwattr $C$DW$344, DW_AT_decl_column(0x1b)
$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$345, DW_AT_name("PWM_OUT_H2_BIT")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("PWM_OUT_H2_BIT")
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$345, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$345, DW_AT_decl_line(0x29)
	.dwattr $C$DW$345, DW_AT_decl_column(0x2b)
$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$346, DW_AT_name("PWM_OUT_L2_BIT")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("PWM_OUT_L2_BIT")
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$346, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$346, DW_AT_decl_line(0x29)
	.dwattr $C$DW$346, DW_AT_decl_column(0x3b)
$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$347, DW_AT_name("PWM_OUT_H3_BIT")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("PWM_OUT_H3_BIT")
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$347, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$347, DW_AT_decl_line(0x29)
	.dwattr $C$DW$347, DW_AT_decl_column(0x4b)
$C$DW$348	.dwtag  DW_TAG_member
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$348, DW_AT_name("PWM_OUT_L3_BIT")
	.dwattr $C$DW$348, DW_AT_TI_symbol_name("PWM_OUT_L3_BIT")
	.dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$348, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$348, DW_AT_decl_line(0x29)
	.dwattr $C$DW$348, DW_AT_decl_column(0x5b)
$C$DW$349	.dwtag  DW_TAG_member
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$349, DW_AT_name("PWM_OUT_H1")
	.dwattr $C$DW$349, DW_AT_TI_symbol_name("PWM_OUT_H1")
	.dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$349, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$349, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$349, DW_AT_decl_column(0x0b)
$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$350, DW_AT_name("PWM_OUT_L1")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("PWM_OUT_L1")
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$350, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$350, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$350, DW_AT_decl_column(0x17)
$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$351, DW_AT_name("PWM_OUT_H2")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("PWM_OUT_H2")
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$351, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$351, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$351, DW_AT_decl_column(0x23)
$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$352, DW_AT_name("PWM_OUT_L2")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("PWM_OUT_L2")
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$352, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$352, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$352, DW_AT_decl_column(0x2f)
$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$353, DW_AT_name("PWM_OUT_H3")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("PWM_OUT_H3")
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$353, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$353, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$353, DW_AT_decl_column(0x3b)
$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$354, DW_AT_name("PWM_OUT_L3")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("PWM_OUT_L3")
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$354, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$354, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$354, DW_AT_decl_column(0x47)
$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$355, DW_AT_name("PWM_GEN_A")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("PWM_GEN_A")
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$355, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$355, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$355, DW_AT_decl_column(0x0b)
$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$356, DW_AT_name("PWM_GEN_B")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("PWM_GEN_B")
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$356, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$356, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$356, DW_AT_decl_column(0x16)
$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$357, DW_AT_name("PWM_GEN_C")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("PWM_GEN_C")
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$357, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$357, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$357, DW_AT_decl_column(0x21)
$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$358, DW_AT_name("PWM_GEN_A_BIT")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("PWM_GEN_A_BIT")
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$358, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$358, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$358, DW_AT_decl_column(0x0b)
$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$359, DW_AT_name("PWM_GEN_B_BIT")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("PWM_GEN_B_BIT")
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$359, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$359, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$359, DW_AT_decl_column(0x1a)
$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$360, DW_AT_name("PWM_GEN_C_BIT")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("PWM_GEN_C_BIT")
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$360, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$360, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$360, DW_AT_decl_column(0x29)

$C$DW$54	.dwtag  DW_TAG_subprogram, DW_AT_name("PWMClass")
	.dwattr $C$DW$54, DW_AT_declaration
	.dwattr $C$DW$54, DW_AT_TI_symbol_name("_ZN8PWMClassC1Ev")
	.dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$55	.dwtag  DW_TAG_subprogram, DW_AT_name("~PWMClass")
	.dwattr $C$DW$55, DW_AT_declaration
	.dwattr $C$DW$55, DW_AT_TI_symbol_name("_ZN8PWMClassD1Ev")
	.dwattr $C$DW$55, DW_AT_virtuality(0x01), DW_AT_vtable_elem_location[DW_OP_constu 0x00]
	.dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$56	.dwtag  DW_TAG_subprogram, DW_AT_name("setPWMWidth")
	.dwattr $C$DW$56, DW_AT_declaration
	.dwattr $C$DW$56, DW_AT_TI_symbol_name("_ZN8PWMClass11setPWMWidthEj")
	.dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$361	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$26)
	.dwendtag $C$DW$56


$C$DW$57	.dwtag  DW_TAG_subprogram, DW_AT_name("init")
	.dwattr $C$DW$57, DW_AT_declaration
	.dwattr $C$DW$57, DW_AT_TI_symbol_name("_ZN8PWMClass4initEj")
	.dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_protected)
$C$DW$362	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$26)
	.dwendtag $C$DW$57


$C$DW$58	.dwtag  DW_TAG_subprogram, DW_AT_name("setOutputEnableState")
	.dwattr $C$DW$58, DW_AT_declaration
	.dwattr $C$DW$58, DW_AT_TI_symbol_name("_ZN8PWMClass20setOutputEnableStateEbbbbbb")
	.dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_protected)
$C$DW$363	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$4)
$C$DW$364	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$4)
$C$DW$365	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$4)
$C$DW$366	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$4)
$C$DW$367	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$4)
$C$DW$368	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$4)
	.dwendtag $C$DW$58


$C$DW$59	.dwtag  DW_TAG_subprogram, DW_AT_name("setOutputInvertState")
	.dwattr $C$DW$59, DW_AT_declaration
	.dwattr $C$DW$59, DW_AT_TI_symbol_name("_ZN8PWMClass20setOutputInvertStateEbbbbbb")
	.dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_protected)
$C$DW$369	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$4)
$C$DW$370	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$4)
$C$DW$371	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$4)
$C$DW$372	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$4)
$C$DW$373	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$4)
$C$DW$374	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$4)
	.dwendtag $C$DW$59


$C$DW$60	.dwtag  DW_TAG_subprogram, DW_AT_name("initAsPWM0")
	.dwattr $C$DW$60, DW_AT_declaration
	.dwattr $C$DW$60, DW_AT_TI_symbol_name("_ZN8PWMClass10initAsPWM0Ev")
	.dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_private)

$C$DW$61	.dwtag  DW_TAG_subprogram, DW_AT_name("initAsPWM1")
	.dwattr $C$DW$61, DW_AT_declaration
	.dwattr $C$DW$61, DW_AT_TI_symbol_name("_ZN8PWMClass10initAsPWM1Ev")
	.dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_private)

$C$DW$62	.dwtag  DW_TAG_subprogram, DW_AT_name("PWMClass")
	.dwattr $C$DW$62, DW_AT_declaration
	.dwattr $C$DW$62, DW_AT_TI_symbol_name("_ZN8PWMClassC1ERKS_")
	.dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$375	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$78)
	.dwendtag $C$DW$62


$C$DW$63	.dwtag  DW_TAG_subprogram, DW_AT_name("operator =")
	.dwattr $C$DW$63, DW_AT_declaration
	.dwattr $C$DW$63, DW_AT_TI_symbol_name("_ZN8PWMClassaSERKS_")
	.dwattr $C$DW$63, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$376	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$78)
	.dwendtag $C$DW$63

	.dwendtag $C$DW$T$82

	.dwattr $C$DW$T$82, DW_AT_decl_file("..\src\PWM.h")
	.dwattr $C$DW$T$82, DW_AT_decl_line(0x15)
	.dwattr $C$DW$T$82, DW_AT_decl_column(0x07)
$C$DW$T$77	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$82)
$C$DW$T$78	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$T$78, DW_AT_address_class(0x20)
$C$DW$T$80	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$T$80, DW_AT_address_class(0x20)

$C$DW$T$81	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$377	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$78)
	.dwendtag $C$DW$T$81


$C$DW$T$93	.dwtag  DW_TAG_class_type
	.dwattr $C$DW$T$93, DW_AT_name("ZCDetectorClass")
	.dwattr $C$DW$T$93, DW_AT_byte_size(0x08)
$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$378, DW_AT_name("__vptr")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("__vptr")
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$378, DW_AT_decl_file("..\src\ZCDetector.h")
	.dwattr $C$DW$378, DW_AT_decl_line(0x10)
	.dwattr $C$DW$378, DW_AT_decl_column(0x07)
$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$379, DW_AT_name("zeroCrossingDirection")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("zeroCrossingDirection")
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$379, DW_AT_decl_file("..\src\ZCDetector.h")
	.dwattr $C$DW$379, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$379, DW_AT_decl_column(0x1a)

$C$DW$64	.dwtag  DW_TAG_subprogram, DW_AT_name("ZCDetectorClass")
	.dwattr $C$DW$64, DW_AT_declaration
	.dwattr $C$DW$64, DW_AT_TI_symbol_name("_ZN15ZCDetectorClassC1Ev")
	.dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$65	.dwtag  DW_TAG_subprogram, DW_AT_name("~ZCDetectorClass")
	.dwattr $C$DW$65, DW_AT_declaration
	.dwattr $C$DW$65, DW_AT_TI_symbol_name("_ZN15ZCDetectorClassD1Ev")
	.dwattr $C$DW$65, DW_AT_virtuality(0x01), DW_AT_vtable_elem_location[DW_OP_constu 0x00]
	.dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$66	.dwtag  DW_TAG_subprogram, DW_AT_name("setZCDirection")
	.dwattr $C$DW$66, DW_AT_declaration
	.dwattr $C$DW$66, DW_AT_TI_symbol_name("_ZN15ZCDetectorClass14setZCDirectionE23zeroCrossingDirection_t")
	.dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$380	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$85)
	.dwendtag $C$DW$66


$C$DW$67	.dwtag  DW_TAG_subprogram, DW_AT_name("ZCDetected")
	.dwattr $C$DW$67, DW_AT_declaration
	.dwattr $C$DW$67, DW_AT_TI_symbol_name("_ZN15ZCDetectorClass10ZCDetectedEjj")
	.dwattr $C$DW$67, DW_AT_type(*$C$DW$T$4)
	.dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_protected)
$C$DW$381	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$26)
$C$DW$382	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$26)
	.dwendtag $C$DW$67


$C$DW$68	.dwtag  DW_TAG_subprogram, DW_AT_name("ZCDetectorClass")
	.dwattr $C$DW$68, DW_AT_declaration
	.dwattr $C$DW$68, DW_AT_TI_symbol_name("_ZN15ZCDetectorClassC1ERKS_")
	.dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$383	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$89)
	.dwendtag $C$DW$68


$C$DW$69	.dwtag  DW_TAG_subprogram, DW_AT_name("operator =")
	.dwattr $C$DW$69, DW_AT_declaration
	.dwattr $C$DW$69, DW_AT_TI_symbol_name("_ZN15ZCDetectorClassaSERKS_")
	.dwattr $C$DW$69, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$384	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$89)
	.dwendtag $C$DW$69

	.dwendtag $C$DW$T$93

	.dwattr $C$DW$T$93, DW_AT_decl_file("..\src\ZCDetector.h")
	.dwattr $C$DW$T$93, DW_AT_decl_line(0x10)
	.dwattr $C$DW$T$93, DW_AT_decl_column(0x07)
$C$DW$T$88	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$93)
$C$DW$T$89	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$T$89, DW_AT_address_class(0x20)
$C$DW$T$91	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$T$91, DW_AT_address_class(0x20)

$C$DW$T$92	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$385	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$89)
	.dwendtag $C$DW$T$92


$C$DW$T$102	.dwtag  DW_TAG_class_type
	.dwattr $C$DW$T$102, DW_AT_name("_Lockit")
	.dwattr $C$DW$T$102, DW_AT_byte_size(0x01)

$C$DW$70	.dwtag  DW_TAG_subprogram, DW_AT_name("_Lockit")
	.dwattr $C$DW$70, DW_AT_declaration
	.dwattr $C$DW$70, DW_AT_TI_symbol_name("_ZNSt7_LockitC1Ev")
	.dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$71	.dwtag  DW_TAG_subprogram, DW_AT_name("_Lockit")
	.dwattr $C$DW$71, DW_AT_declaration
	.dwattr $C$DW$71, DW_AT_TI_symbol_name("_ZNSt7_LockitC1Ei")
	.dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$386	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$10)
	.dwendtag $C$DW$71


$C$DW$72	.dwtag  DW_TAG_subprogram, DW_AT_name("~_Lockit")
	.dwattr $C$DW$72, DW_AT_declaration
	.dwattr $C$DW$72, DW_AT_TI_symbol_name("_ZNSt7_LockitD1Ev")
	.dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$73	.dwtag  DW_TAG_subprogram, DW_AT_name("_Lockit")
	.dwattr $C$DW$73, DW_AT_declaration
	.dwattr $C$DW$73, DW_AT_TI_symbol_name("_ZNSt7_LockitC1ERKS_")
	.dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$387	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$98)
	.dwendtag $C$DW$73


$C$DW$74	.dwtag  DW_TAG_subprogram, DW_AT_name("operator =")
	.dwattr $C$DW$74, DW_AT_declaration
	.dwattr $C$DW$74, DW_AT_TI_symbol_name("_ZNSt7_LockitaSERKS_")
	.dwattr $C$DW$74, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$388	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$98)
	.dwendtag $C$DW$74

	.dwendtag $C$DW$T$102

	.dwattr $C$DW$T$102, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/yvals.h")
	.dwattr $C$DW$T$102, DW_AT_decl_line(0x26c)
	.dwattr $C$DW$T$102, DW_AT_decl_column(0x07)
$C$DW$T$97	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$102)
$C$DW$T$98	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$T$98, DW_AT_address_class(0x20)
$C$DW$T$100	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$T$100, DW_AT_address_class(0x20)

$C$DW$T$101	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$389	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$98)
	.dwendtag $C$DW$T$101


$C$DW$T$107	.dwtag  DW_TAG_class_type
	.dwattr $C$DW$T$107, DW_AT_name("_Mutex")
	.dwattr $C$DW$T$107, DW_AT_byte_size(0x01)

$C$DW$75	.dwtag  DW_TAG_subprogram, DW_AT_name("_Lock")
	.dwattr $C$DW$75, DW_AT_declaration
	.dwattr $C$DW$75, DW_AT_TI_symbol_name("_ZNSt6_Mutex5_LockEv")
	.dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$76	.dwtag  DW_TAG_subprogram, DW_AT_name("_Unlock")
	.dwattr $C$DW$76, DW_AT_declaration
	.dwattr $C$DW$76, DW_AT_TI_symbol_name("_ZNSt6_Mutex7_UnlockEv")
	.dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$77	.dwtag  DW_TAG_subprogram, DW_AT_name("operator =")
	.dwattr $C$DW$77, DW_AT_declaration
	.dwattr $C$DW$77, DW_AT_TI_symbol_name("_ZNSt6_MutexaSERKS_")
	.dwattr $C$DW$77, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$390	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$105)
	.dwendtag $C$DW$77

	.dwendtag $C$DW$T$107

	.dwattr $C$DW$T$107, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/yvals.h")
	.dwattr $C$DW$T$107, DW_AT_decl_line(0x29f)
	.dwattr $C$DW$T$107, DW_AT_decl_column(0x07)
$C$DW$T$104	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$107)
$C$DW$T$105	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$T$105, DW_AT_address_class(0x20)
$C$DW$T$103	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$107)
	.dwattr $C$DW$T$103, DW_AT_address_class(0x20)

$C$DW$T$106	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$391	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$105)
	.dwendtag $C$DW$T$106


$C$DW$T$108	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$108, DW_AT_name("__SO__15ZCDetectorClass")
	.dwattr $C$DW$T$108, DW_AT_byte_size(0x05)
$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$392, DW_AT_name("__vptr")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("__vptr")
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$392, DW_AT_decl_file("..\src\ZCDetector.h")
	.dwattr $C$DW$392, DW_AT_decl_line(0x10)
	.dwattr $C$DW$392, DW_AT_decl_column(0x07)
$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$393, DW_AT_name("zeroCrossingDirection")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("zeroCrossingDirection")
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$393, DW_AT_decl_file("..\src\ZCDetector.h")
	.dwattr $C$DW$393, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$393, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$108

	.dwattr $C$DW$T$108, DW_AT_decl_file("..\src\ZCDetector.h")
	.dwattr $C$DW$T$108, DW_AT_decl_line(0x10)
	.dwattr $C$DW$T$108, DW_AT_decl_column(0x07)

$C$DW$T$110	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$110, DW_AT_name("__SO__8ADCClass")
	.dwattr $C$DW$T$110, DW_AT_byte_size(0x59)
$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_name("__b_15ZCDetectorClass")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("__b_15ZCDetectorClass")
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$394, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$394, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$394, DW_AT_decl_column(0x07)
$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_name("LED")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("LED")
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$395, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$395, DW_AT_decl_line(0x33)
	.dwattr $C$DW$395, DW_AT_decl_column(0x0b)
$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_name("CommutationTimer")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("CommutationTimer")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$396, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$396, DW_AT_decl_line(0x34)
	.dwattr $C$DW$396, DW_AT_decl_column(0x1e)
$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_name("motorParent")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("motorParent")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$397, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$397, DW_AT_decl_line(0x35)
	.dwattr $C$DW$397, DW_AT_decl_column(0x0e)
$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_name("ADC_BASE")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("ADC_BASE")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$398, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$398, DW_AT_decl_line(0x37)
	.dwattr $C$DW$398, DW_AT_decl_column(0x0b)
$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_name("PWM_BASE")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("PWM_BASE")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$399, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$399, DW_AT_decl_line(0x37)
	.dwattr $C$DW$399, DW_AT_decl_column(0x15)
$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_name("SYSCTL_PERIPH_ADC")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("SYSCTL_PERIPH_ADC")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$400, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$400, DW_AT_decl_line(0x38)
	.dwattr $C$DW$400, DW_AT_decl_column(0x0b)
$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_name("SYSCTL_PERIPH_GPIO")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("SYSCTL_PERIPH_GPIO")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$401, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$401, DW_AT_decl_line(0x38)
	.dwattr $C$DW$401, DW_AT_decl_column(0x1e)
$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_name("GPIO_PORT_BASE")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("GPIO_PORT_BASE")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$402, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$402, DW_AT_decl_line(0x39)
	.dwattr $C$DW$402, DW_AT_decl_column(0x0b)
$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_name("GPIO_PIN_A")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("GPIO_PIN_A")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$403, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$403, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$403, DW_AT_decl_column(0x0b)
$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_name("GPIO_PIN_B")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("GPIO_PIN_B")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$404, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$404, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$404, DW_AT_decl_column(0x17)
$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_name("GPIO_PIN_C")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("GPIO_PIN_C")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$405, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$405, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$405, DW_AT_decl_column(0x23)
$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_name("ADC_TRIGGER_PWM")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("ADC_TRIGGER_PWM")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$406, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$406, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$406, DW_AT_decl_column(0x0b)
$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_name("ADC_CTL_A")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("ADC_CTL_A")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$407, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$407, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$407, DW_AT_decl_column(0x0b)
$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_name("ADC_CTL_B")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("ADC_CTL_B")
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$408, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$408, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$408, DW_AT_decl_column(0x16)
$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_name("ADC_CTL_C")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("ADC_CTL_C")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$409, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$409, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$409, DW_AT_decl_column(0x21)
$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_name("buf")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("buf")
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$410, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$410, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$410, DW_AT_decl_column(0x0b)
$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$411, DW_AT_name("ZCDetectedFlag")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("ZCDetectedFlag")
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_private)
	.dwattr $C$DW$411, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$411, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$411, DW_AT_decl_column(0x07)
	.dwendtag $C$DW$T$110

	.dwattr $C$DW$T$110, DW_AT_decl_file("..\src\ADC.h")
	.dwattr $C$DW$T$110, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$T$110, DW_AT_decl_column(0x07)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("__SO__St7_Lockit")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/yvals.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x26c)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x07)

$C$DW$T$111	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$111, DW_AT_name("__array_type_info")
	.dwattr $C$DW$T$111, DW_AT_byte_size(0x08)
$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$412, DW_AT_name("base")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("base")
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$412, DW_AT_decl_file("../src/ADC.cpp")
	.dwattr $C$DW$412, DW_AT_decl_line(0xce)
	.dwattr $C$DW$412, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$111

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)

$C$DW$T$28	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$T$164	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$164, DW_AT_address_class(0x20)

$C$DW$T$29	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$413	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$26)
$C$DW$414	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$24)
$C$DW$415	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$25)
	.dwendtag $C$DW$T$29


$C$DW$T$33	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$416	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$32)
	.dwendtag $C$DW$T$33


$C$DW$T$38	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$417	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$37)
	.dwendtag $C$DW$T$38


$C$DW$T$49	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$418	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$26)
$C$DW$419	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$48)
$C$DW$420	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$25)
	.dwendtag $C$DW$T$49


$C$DW$T$50	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$421	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$26)
	.dwendtag $C$DW$T$50


$C$DW$T$53	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$422	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$52)
	.dwendtag $C$DW$T$53


$C$DW$T$59	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$423	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$26)
$C$DW$424	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$48)
	.dwendtag $C$DW$T$59


$C$DW$T$62	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$425	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$61)
	.dwendtag $C$DW$T$62


$C$DW$T$71	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$426	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$70)
	.dwendtag $C$DW$T$71


$C$DW$T$76	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$427	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$4)
$C$DW$428	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$4)
$C$DW$429	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$4)
$C$DW$430	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$4)
$C$DW$431	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$4)
$C$DW$432	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$4)
	.dwendtag $C$DW$T$76


$C$DW$T$79	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$433	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$78)
	.dwendtag $C$DW$T$79


$C$DW$T$86	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$434	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$85)
	.dwendtag $C$DW$T$86


$C$DW$T$90	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$435	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$89)
	.dwendtag $C$DW$T$90


$C$DW$T$96	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$436	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$10)
	.dwendtag $C$DW$T$96


$C$DW$T$99	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$437	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$98)
	.dwendtag $C$DW$T$99


$C$DW$T$136	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$438	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$134)
	.dwendtag $C$DW$T$136


$C$DW$T$139	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$439	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$138)
	.dwendtag $C$DW$T$139

$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$202	.dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
	.dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$4)
	.dwattr $C$DW$T$202, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$202, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/yvals.h")
	.dwattr $C$DW$T$202, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$T$202, DW_AT_decl_column(0x0e)

$C$DW$T$34	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$4)
	.dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C_plus_plus)

$C$DW$T$87	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$4)
	.dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$440	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$26)
$C$DW$441	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$26)
	.dwendtag $C$DW$T$87

$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$203	.dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
	.dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$5)
	.dwattr $C$DW$T$203, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$203, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$203, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$T$203, DW_AT_decl_column(0x1d)
$C$DW$T$204	.dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
	.dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$203)
	.dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$204, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$204, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$204, DW_AT_decl_column(0x17)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$171	.dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
	.dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$171, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$171, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$T$171, DW_AT_decl_column(0x1c)
$C$DW$T$208	.dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
	.dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$171)
	.dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$208, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$208, DW_AT_decl_line(0x38)
	.dwattr $C$DW$T$208, DW_AT_decl_column(0x16)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
$C$DW$T$209	.dwtag  DW_TAG_typedef, DW_AT_name("_Wchart")
	.dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$7)
	.dwattr $C$DW$T$209, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$209, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/yvals.h")
	.dwattr $C$DW$T$209, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$T$209, DW_AT_decl_column(0x11)
$C$DW$T$210	.dwtag  DW_TAG_typedef, DW_AT_name("_Wintt")
	.dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$7)
	.dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$210, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/yvals.h")
	.dwattr $C$DW$T$210, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$T$210, DW_AT_decl_column(0x11)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
$C$DW$T$211	.dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
	.dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$211, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$211, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$T$211, DW_AT_decl_column(0x1d)
$C$DW$T$212	.dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
	.dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$211)
	.dwattr $C$DW$T$212, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$212, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$212, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$T$212, DW_AT_decl_column(0x17)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
$C$DW$T$213	.dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
	.dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$213, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$213, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$213, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$T$213, DW_AT_decl_column(0x1c)
$C$DW$T$214	.dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
	.dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$213)
	.dwattr $C$DW$T$214, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$214, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$214, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$T$214, DW_AT_decl_column(0x16)
$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
$C$DW$T$215	.dwtag  DW_TAG_typedef, DW_AT_name("_Ptrdifft")
	.dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$215, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$215, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/yvals.h")
	.dwattr $C$DW$T$215, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$T$215, DW_AT_decl_column(0x1e)
$C$DW$T$67	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$10)
$C$DW$T$68	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$68, DW_AT_address_class(0x20)

$C$DW$T$216	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$216, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$216, DW_AT_byte_size(0x10)
$C$DW$442	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$442, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$216


$C$DW$T$217	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$217, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$217, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$443	.dwtag  DW_TAG_subrange_type
	.dwendtag $C$DW$T$217

$C$DW$T$221	.dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
	.dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$221, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$221, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$221, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$221, DW_AT_decl_column(0x1d)
$C$DW$T$224	.dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
	.dwattr $C$DW$T$224, DW_AT_type(*$C$DW$T$221)
	.dwattr $C$DW$T$224, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$224, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$224, DW_AT_decl_line(0x47)
	.dwattr $C$DW$T$224, DW_AT_decl_column(0x17)
$C$DW$T$225	.dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
	.dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$221)
	.dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$225, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$225, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$T$225, DW_AT_decl_column(0x17)
$C$DW$T$226	.dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
	.dwattr $C$DW$T$226, DW_AT_type(*$C$DW$T$221)
	.dwattr $C$DW$T$226, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$226, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$226, DW_AT_decl_line(0x45)
	.dwattr $C$DW$T$226, DW_AT_decl_column(0x17)
$C$DW$T$227	.dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
	.dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$221)
	.dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$227, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$227, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$T$227, DW_AT_decl_column(0x17)
$C$DW$T$230	.dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
	.dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$230, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$230, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$230, DW_AT_decl_line(0x52)
	.dwattr $C$DW$T$230, DW_AT_decl_column(0x1a)
$C$DW$T$231	.dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
	.dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$231, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stddef.h")
	.dwattr $C$DW$T$231, DW_AT_decl_line(0x31)
	.dwattr $C$DW$T$231, DW_AT_decl_column(0x1c)
$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
$C$DW$T$232	.dwtag  DW_TAG_typedef, DW_AT_name("_Sizet")
	.dwattr $C$DW$T$232, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$232, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$232, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/yvals.h")
	.dwattr $C$DW$T$232, DW_AT_decl_line(0xac)
	.dwattr $C$DW$T$232, DW_AT_decl_column(0x1a)
$C$DW$T$239	.dwtag  DW_TAG_typedef, DW_AT_name("size_t")
	.dwattr $C$DW$T$239, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$239, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$239, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stddef.h")
	.dwattr $C$DW$T$239, DW_AT_decl_line(0x35)
	.dwattr $C$DW$T$239, DW_AT_decl_column(0x19)
$C$DW$T$26	.dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$26, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x1c)

$C$DW$T$27	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x08)
$C$DW$444	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$444, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$27


$C$DW$T$30	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C_plus_plus)

$C$DW$T$35	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$445	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$26)
	.dwendtag $C$DW$T$35

$C$DW$T$222	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$222, DW_AT_address_class(0x20)
$C$DW$T$240	.dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
	.dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$240, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$240, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$240, DW_AT_decl_line(0x48)
	.dwattr $C$DW$T$240, DW_AT_decl_column(0x16)
$C$DW$T$241	.dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
	.dwattr $C$DW$T$241, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$241, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$241, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$241, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$241, DW_AT_decl_column(0x16)
$C$DW$T$242	.dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
	.dwattr $C$DW$T$242, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$242, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$242, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$242, DW_AT_decl_line(0x46)
	.dwattr $C$DW$T$242, DW_AT_decl_column(0x16)
$C$DW$T$243	.dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
	.dwattr $C$DW$T$243, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$243, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$243, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$243, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$T$243, DW_AT_decl_column(0x16)
$C$DW$T$247	.dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
	.dwattr $C$DW$T$247, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$247, DW_AT_language(DW_LANG_C_plus_plus)
	.dwattr $C$DW$T$247, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.5/include/stdint.h")
	.dwattr $C$DW$T$247, DW_AT_decl_line(0x53)
	.dwattr $C$DW$T$247, DW_AT_decl_column(0x1a)
$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
